; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph4 - mode
	spectrograph0 - mode
	thermograph2 - mode
	thermograph3 - mode
	spectrograph1 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon14)
)
(:goal (and
	(have_image Phenomenon5 thermograph2)
	(have_image Planet6 thermograph2)
	(have_image Phenomenon7 spectrograph4)
	(have_image Star8 spectrograph1)
	(have_image Phenomenon9 thermograph3)
	(have_image Star10 spectrograph0)
	(have_image Planet11 spectrograph4)
	(have_image Star12 spectrograph4)
	(have_image Planet13 spectrograph1)
	(have_image Phenomenon14 spectrograph1)
	(have_image Star15 spectrograph0)
))

)

; plan
1. (turn_to satellite0 groundstation4 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 11
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 11
4. (turn_to satellite0 planet11 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet11)
   goals met: 0 of 11
5. (take_image satellite0 planet11 instrument0 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 1 of 11
6. (turn_to satellite0 phenomenon9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 11
7. (take_image satellite0 phenomenon9 instrument0 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 2 of 11
8. (turn_to satellite0 phenomenon7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 11
9. (take_image satellite0 phenomenon7 instrument0 spectrograph4)
   added: (have_image phenomenon7 spectrograph4)
   goals met: 3 of 11
10. (turn_to satellite0 phenomenon5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 11
11. (take_image satellite0 phenomenon5 instrument0 thermograph2)
   added: (have_image phenomenon5 thermograph2)
   goals met: 4 of 11
12. (turn_to satellite0 phenomenon14 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 11
13. (take_image satellite0 phenomenon14 instrument0 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 5 of 11
14. (turn_to satellite0 planet13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet13)
   goals met: 5 of 11
15. (take_image satellite0 planet13 instrument0 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 6 of 11
16. (turn_to satellite0 planet6 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet6)
   goals met: 6 of 11
17. (take_image satellite0 planet6 instrument0 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 7 of 11
18. (turn_to satellite0 star10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star10)
   goals met: 7 of 11
19. (take_image satellite0 star10 instrument0 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 8 of 11
20. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 8 of 11
21. (take_image satellite0 star12 instrument0 spectrograph4)
   added: (have_image star12 spectrograph4)
   goals met: 9 of 11
22. (turn_to satellite0 star15 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star15)
   goals met: 9 of 11
23. (take_image satellite0 star15 instrument0 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 10 of 11
24. (turn_to satellite0 star8 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star8)
   goals met: 10 of 11
25. (take_image satellite0 star8 instrument0 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 11 of 11
